"""高阶函数"""

#map===========================================================
#map()函数接收两个参数，一个是函数，一个是序列，map将传入的函数依次作用到序列的每个元素，并把结果作##为新的list返回
def f(x):
    return x*x
map(f,[1,2,3,4,5,6,7,8,9])
map(str, [1, 2, 3, 4, 5, 6, 7, 8, 9])

#reduce=========================================================
#把一个函数作用在一个序列[x1, x2, x3...]上，这个函数必须接收两个参数，reduce把结果继续和序列的下一##个元素做累积计算

#fliter===========================================================
#接收一个函数和一个序列,filter()把传入的函数依次作用于每个元素，然后根据返回值是True还是False决定保##留还是丢弃该元素
def is_odd(n):
    return n%2==1
fliter(is_odd,[1,2,4,5,6]

#sorted================================================================
#比较两个元素的大小进行排序。
sorted([36, 5, 12, 9, 21])
sorted(['bob', 'about', 'Zoo', 'Credit'])#

#匿名函数==============================================================
map(lambda x: x * x, [1, 2, 3, 4, 5, 6, 7, 8, 9])
def build(x,y):
    return lambda:x*x=y*y


